In [0]:
!wget -O moviedataset.zip https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/ML0101ENv3/labs/moviedataset.zip
print('unziping ...')
!unzip -o -j moviedataset.zip

--2019-08-01 16:31:19--  https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/ML0101ENv3/labs/moviedataset.zip
Resolving s3-api.us-geo.objectstorage.softlayer.net (s3-api.us-geo.objectstorage.softlayer.net)... 67.228.254.193
Connecting to s3-api.us-geo.objectstorage.softlayer.net (s3-api.us-geo.objectstorage.softlayer.net)|67.228.254.193|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 160301210 (153M) [application/zip]
Saving to: ‘moviedataset.zip’

moviedataset.zip    100%[===================>] 152.88M  34.1MB/s    in 4.5s

2019-08-01 16:31:23 (33.7 MB/s) - ‘moviedataset.zip’ saved [160301210/160301210]

unziping ...
Archive:  moviedataset.zip
  inflating: links.csv
  inflating: movies.csv
  inflating: ratings.csv
  inflating: README.txt
  inflating: tags.csv

In [0]:
import pandas as pd
from math import sqrt
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [0]:
df=pd.read_csv("movies.csv")
df.head()

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance
3        4  ...                         Comedy|Drama|Romance
4        5  ...                                       Comedy

[5 rows x 3 columns]

In [0]:
df1=pd.read_csv("ratings.csv")
df1.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

In [0]:
df['year'] = df.title.str.extract('(\(\d\d\d\d\))',expand=False)

In [0]:
df['year'] = df.title.str.extract('(\d\d\d\d)',expand=False)

In [0]:
df.head()

   movieId  ...  year
0        1  ...  1995
1        2  ...  1995
2        3  ...  1995
3        4  ...  1995
4        5  ...  1995

[5 rows x 4 columns]

In [0]:
df['title'] = df.title.str.replace('(\(\d\d\d\d\))',' ')

In [0]:
df.head()

   movieId  ...  year
0        1  ...  1995
1        2  ...  1995
2        3  ...  1995
3        4  ...  1995
4        5  ...  1995

[5 rows x 4 columns]

In [0]:
df['title']=df['title'].apply(lambda x: x.strip())

In [0]:
df.head()

   movieId  ...  year
0        1  ...  1995
1        2  ...  1995
2        3  ...  1995
3        4  ...  1995
4        5  ...  1995

[5 rows x 4 columns]

In [0]:
df=df.drop('genres',1)

In [0]:
df.head()

   movieId                        title  year
0        1                    Toy Story  1995
1        2                      Jumanji  1995
2        3             Grumpier Old Men  1995
3        4            Waiting to Exhale  1995
4        5  Father of the Bride Part II  1995

In [0]:
df1.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

In [0]:
df1.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

In [0]:
userInput = [
            {'title':'Breakfast Club, The', 'rating':5},
            {'title':'Toy Story', 'rating':3.5},
            {'title':'Jumanji', 'rating':2},
            {'title':"Pulp Fiction", 'rating':5},
            {'title':'Akira', 'rating':4.5},
            {'title':'Waiting to Exhale','rating':5}
         ]

inputmovies=pd.DataFrame(userInput)

In [0]:
inputmovies

   rating                title
0     5.0  Breakfast Club, The
1     3.5            Toy Story
2     2.0              Jumanji
3     5.0         Pulp Fiction
4     4.5                Akira
5     5.0    Waiting to Exhale

In [0]:
inputid=df[df['title'].isin(inputmovies['title'].tolist())]

In [0]:
inputmovies=pd.merge(inputid,inputmovies)

In [0]:
inputmovies

   movieId                title  year  rating
0        1            Toy Story  1995     3.5
1        2              Jumanji  1995     2.0
2        4    Waiting to Exhale  1995     5.0
3      296         Pulp Fiction  1994     5.0
4     1274                Akira  1988     4.5
5     1968  Breakfast Club, The  1985     5.0

In [0]:
inputmovies=inputmovies.drop('year',1)

In [0]:
inputmovies

   movieId                title  rating
0        1            Toy Story     3.5
1        2              Jumanji     2.0
2        4    Waiting to Exhale     5.0
3      296         Pulp Fiction     5.0
4     1274                Akira     4.5
5     1968  Breakfast Club, The     5.0

In [0]:
user=df1[df1['movieId'].isin(inputmovies['movieId'])]

In [0]:
user.head(20)

      userId  movieId  rating   timestamp
19         4      296     4.0  1037741922
441       12     1968     3.0   953778911
479       13        2     2.0   974867742
531       13     1274     5.0   974870639
681       14      296     2.0   845469280
749       15        1     4.0  1137894004
776       15      296     3.0  1153012598
911       15     1968     3.0  1137891855
1247      17        1     5.0   944991567
1248      17        2     3.0   944991114
1250      17        4     3.0   944993166
1333      17      296     2.0   944995260
1851      17     1968     3.0   944992532
2283      18      296     4.0   844372406
2342      20      296     3.0  1186099045
2752      23        1     5.0  1378675311
2981      26     1968     5.0   974237157
3017      28        1     4.0  1098785105
3266      31      296     4.5  1338650820
3363      32      296     5.0   847546483

In [0]:
inputmovies

   movieId                title  rating
0        1            Toy Story     3.5
1        2              Jumanji     2.0
2        4    Waiting to Exhale     5.0
3      296         Pulp Fiction     5.0
4     1274                Akira     4.5
5     1968  Breakfast Club, The     5.0

In [0]:

usergroup=user.groupby(['userId'])

In [0]:
usergroup.get_group(26)

      userId  movieId  rating  timestamp
2981      26     1968     5.0  974237157

In [0]:
usergroup=sorted(usergroup, key=lambda x: len(x[1]),reverse=True)

In [0]:
pearsonCorrelationDict = {}

#For every user group in our subset
for name, group in usergroup:
    #Let's start by sorting the input and current user group so the values aren't mixed up later on
    group = group.sort_values(by='movieId')
    inputmovies = inputmovies.sort_values(by='movieId')
    #Get the N for the formula
    nRatings = len(group)
    #Get the review scores for the movies that they both have in common
    temp_df = inputmovies[inputmovies['movieId'].isin(group['movieId'].tolist())]
    #And then store them in a temporary buffer variable in a list format to facilitate future calculations
    tempRatingList = temp_df['rating'].tolist()
    #Let's also put the current user group reviews in a list format
    tempGroupList = group['rating'].tolist()
    #Now let's calculate the pearson correlation between two users, so called, x and y
    Sxx = sum([i**2 for i in tempRatingList]) - pow(sum(tempRatingList),2)/float(nRatings)
    Syy = sum([i**2 for i in tempGroupList]) - pow(sum(tempGroupList),2)/float(nRatings)
    Sxy = sum( i*j for i, j in zip(tempRatingList, tempGroupList)) - sum(tempRatingList)*sum(tempGroupList)/float(nRatings)
    
    #If the denominator is different than zero, then divide, else, 0 correlation.
    if Sxx != 0 and Syy != 0:
        pearsonCorrelationDict[name] = Sxy/sqrt(Sxx*Syy)
    else:
        pearsonCorrelationDict[name] = 0

In [0]:
pdf=pd.DataFrame.from_dict(pearsonCorrelationDict,orient='index')

In [0]:
pdf.columns=['similarind']
pdf['userId']=pdf.index
pdf.index=range(len(pdf))

In [0]:
pdf.head()

   similarind  userId
0   -0.073127    2432
1   -0.261116    3734
2   -0.131216    4415
3   -0.470882    6530
4    0.883965   12120

In [0]:
topusers=pdf.sort_values(by='similarind',ascending=True)

In [0]:
topusers.head()

       similarind  userId
11359        -1.0   59695
10326        -1.0   42565
8682         -1.0   13820
8660         -1.0   13578
10365        -1.0   43258

In [0]:
topuserRatings=topusers.merge(df1,left_on='userId',right_on='userId',how='inner')

In [0]:
topuserRatings.head()

   similarind  userId  movieId  rating   timestamp
0        -1.0   59695        1     4.0  1182805882
1        -1.0   59695       19     4.5  1182806155
2        -1.0   59695       34     4.0  1182805962
3        -1.0   59695       48     2.5  1182806433
4        -1.0   59695       62     3.0  1182806076

In [0]:
topuserRatings['weightedRating']=topuserRatings['similarind']*topuserRatings['rating']
topuserRatings.head()

   similarind  userId  movieId  rating   timestamp  weightedRating
0        -1.0   59695        1     4.0  1182805882            -4.0
1        -1.0   59695       19     4.5  1182806155            -4.5
2        -1.0   59695       34     4.0  1182805962            -4.0
3        -1.0   59695       48     2.5  1182806433            -2.5
4        -1.0   59695       62     3.0  1182806076            -3.0

In [0]:
temptopusersRatings = topuserRatings.groupby('movieId').sum()[['similarind','weightedRating']]

In [0]:
temptopusersRatings.columns=['sumSimilarityIndex','sumWeightedRating']
temptopusersRatings.head()

         sumSimilarityIndex  sumWeightedRating
movieId
1              10959.543500       33408.941282
2               8714.045275       21371.687705
3               1581.250318        4344.278609
4               -207.623980        -203.978404
5               1433.579474        3524.064409

In [0]:
rec=pd.DataFrame()

In [0]:
rec['weighted average recommandation']=temptopusersRatings['sumWeightedRating']/temptopusersRatings['sumSimilarityIndex']

In [0]:
rec['movieId']=temptopusersRatings.index
rec.head()

         weighted average recommandation  movieId
movieId
1                               3.048388        1
2                               2.452556        2
3                               2.747369        3
4                               0.982441        4
5                               2.458227        5

In [0]:
rec=rec.sort_values(by='weighted average recommandation',ascending=False)

In [0]:
rec.head()

         weighted average recommandation  movieId
movieId
143369                               inf   143369
145388                               inf   145388
106064                               inf   106064
134338                               inf   134338
86809                                inf    86809

In [0]:
df.loc[df['movieId'].isin(rec.head(10)['movieId'].tolist())]

       movieId                                              title  year
8856     26459                             Scarlet Pimpernel, The  1982
14627    73031  Too Shy to Try (Je suis timide... mais je me s...  1978
17198    86809                                      Carolina Moon  2007
22089   106064                                               Race  2008
25131   117442                                    The Monkey King  2014
29315   134338                                         Sarkar Raj  2008
30599   138630                                       In My Dreams  2014
31122   140417                                           Superman  1948
32056   143369                                           The Clan  2015
32620   145388                                            Forever  2015